#!/bin/bash

# ########################################################################################
# 遍历目录下的所有文件 - 
# ########################################################################################

# 当目录下的文件很多的时候, 下面的代码会报错 /bin/ls: Argument list too long
for file in `ls ./files_dir/*.log` 
do 
    echo $file                                                                                                                                                   
done

# 实验目录文件个数: 100W
for file in `ls ./files_dir` 
do 
    echo $file                                                                                                                                                   
done